wfs2/src/wfs.getCapabilities.req.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope
    xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema"
    xmlns:xlink="http://www.w3.org/1999/xlink"
    xmlns:idls="http://inspire.ec.europa.eu/schemas/inspire_dls/1.0"
    xmlns:fes="http://www.opengis.net/fes/2.0"
    xmlns:icommon="http://inspire.ec.europa.eu/schemas/common/1.0"
    xmlns:util="http://www.opengis.net/wfs-util/2.0"
    xmlns:ows="http://www.opengis.net/ows/1.1"
    xmlns:f2i-plu="http://plu.fit2inspire.eu/"
    xmlns:wfs="http://www.opengis.net/wfs/2.0">
 <SOAP-ENV:Body>
   <ows:GetCapabilities updateSequence="">
    <!-- extensibility element(s) -->
    <ows:AcceptVersions>
     <!-- extensibility element(s) -->
     <ows:Version></ows:Version>
    </ows:AcceptVersions>
    <ows:Sections>
     <!-- extensibility element(s) -->
     <ows:Section></ows:Section>
    </ows:Sections>
    <ows:AcceptFormats>
     <!-- extensibility element(s) -->
     <ows:OutputFormat></ows:OutputFormat>
    </ows:AcceptFormats>
   </ows:GetCapabilities>
 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
