src/main/resources/soap_request.xml

<?xml version="1.0" encoding="UTF-8"?>
  <soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope">
  <soap:Body>
     <GetCapabilities service="WMS" xmlns="http://www.opengis.net/ows/1.1">     
        <AcceptVersions> <Version>1.0.0</Version> </AcceptVersions>
        <AcceptFormats> <OutputFormat>application/xml</OutputFormat> </AcceptFormats>   
     </GetCapabilities>
  </soap:Body>
</soap:Envelope>